; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Block grouping domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; A number of blocks of different colours lie on a grid-like environment.
;;; The objective is to group the blocks by colour, i.e. to have all blocks
;;; of the same color in the same cell, which is at the same time
;;; different to the cell where blocks of other colors are:
;;;
;;; forall i, j color(i) = color(j) <=> loc(i) = loc(j)
;;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain mt-block-grouping)
    ;(:requirements :typing )
    (:types block - object )
    (:functions
        (x ?b - block)  ;; The position of a block
        (y ?b - block)  ;;
        (max_x)
        (min_x)
        (max_y)
        (min_y)
    )

    ;; Move a block from its location to an adjacent location
    (:action move_block_up
     :parameters (?b - block)
     :precondition (and (<= (+ (y ?b)1) (max_y) ))
     :effect (and
        (increase (y ?b) 1)
    ))

    (:action move_block_down
     :parameters (?b - block)
     :precondition (and (>= (- (y ?b) 1) (min_y) ))
     :effect (and
        (decrease (y ?b) 1)
    ))

    (:action move_block_right
     :parameters (?b - block)
     :precondition (and (<= (+ (x ?b)1) (max_x) ))
     :effect (and
        (increase (x ?b) 1)
    ))

    (:action move_block_left
     :parameters (?b - block)
     :precondition (and (>= (- (x ?b) 1) (min_x) ))
     :effect (and
        (decrease (x ?b) 1)
    ))

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_15_5_2_1)
  (:domain mt-block-grouping)
  (:objects
    b1 b2 b3 b4 b5 - block
  )

  (:init
    (= (x b3) 1)
  (= (y b3) 2)
  (= (x b4) 10)
  (= (y b4) 10)
  (= (x b2) 13)
  (= (y b2) 3)
  (= (x b1) 13)
  (= (y b1) 10)
  (= (x b5) 13)
  (= (y b5) 10)
  (= (max_x) 15 )
  (= (min_x) 1 )
  (= (max_y) 15 )
  (= (min_y) 1 )
  )

  (:goal (and
    (= (x b1) (x b2))
(= (y b1) (y b2))
  (or (not (= (x b1) (x b3))) (not (= (y b1) (y b3))))
  (= (x b1) (x b4))
(= (y b1) (y b4))
  (= (x b1) (x b5))
(= (y b1) (y b5))
  (or (not (= (x b2) (x b3))) (not (= (y b2) (y b3))))
  (= (x b2) (x b4))
(= (y b2) (y b4))
  (= (x b2) (x b5))
(= (y b2) (y b5))
  (or (not (= (x b3) (x b4))) (not (= (y b3) (y b4))))
  (or (not (= (x b3) (x b5))) (not (= (y b3) (y b5))))
  (= (x b4) (x b5))
(= (y b4) (y b5))
  ))





)

; plan
1. (move_block_up b2)
   changed: (y b2) from 3 to 4
   goals met: 10 of 16
2. (move_block_up b2)
   changed: (y b2) from 4 to 5
   goals met: 10 of 16
3. (move_block_up b2)
   changed: (y b2) from 5 to 6
   goals met: 10 of 16
4. (move_block_up b2)
   changed: (y b2) from 6 to 7
   goals met: 10 of 16
5. (move_block_up b2)
   changed: (y b2) from 7 to 8
   goals met: 10 of 16
6. (move_block_up b2)
   changed: (y b2) from 8 to 9
   goals met: 10 of 16
7. (move_block_up b2)
   changed: (y b2) from 9 to 10
   goals met: 13 of 16
8. (move_block_right b4)
   changed: (x b4) from 10 to 11
   goals met: 13 of 16
9. (move_block_right b4)
   changed: (x b4) from 11 to 12
   goals met: 13 of 16
10. (move_block_right b4)
   changed: (x b4) from 12 to 13
   goals met: 16 of 16
